var province ={
    "热门":["北京","上海","天津","重庆","香港","澳门"],
    "江苏":["南京","无锡","徐州","常州","苏州","南通","连云港","淮安","盐城","扬州","镇江","泰州","宿迁",
           "江阴","宜兴","邳州","新沂","溧阳","张家港","常熟","太仓","昆山","如皋","海门","启东","东台",
           "高邮","仪征","丹阳","扬中","句容","靖江","兴化","泰兴","海安","沭阳"],
    "浙江":["杭州","宁波","温州","绍兴","湖州","嘉兴","金华","衢州","舟山","台州","丽水","建德","富阳","临安",
            "余姚","慈溪","奉化","瑞安","乐清","海宁","平湖","桐乡","诸暨","上虞","嵊州","兰溪","义乌","东阳",
           "永康","江山","临海","温岭","龙泉"],
    "安徽":["合肥","芜湖","蚌埠","淮南","马鞍山","淮北","铜陵","安庆","黄山","阜阳","宿州","滁州","六安","宣城","池州","亳州",
           "巢湖","桐城","天长","明光","界首","宁国"],
    "海南":["海口","三亚","三沙","儋州","五指山","琼海","文昌","万宁","东方"],
    "四川":["成都","绵阳","自贡","攀枝花","泸州","德阳","广元","遂宁","内江","乐山","资阳","宜宾","南充","达州","雅安","广安","巴中","眉山",
           "阿坝","甘孜藏族","凉山彝族",
           "都江堰","彭州","崇州","邛崃","简阳","江油","广汉","什邡","绵竹","隆昌","峨眉山","阆中","万源","马尔康","康定","西昌","华蓥"],
    "云南":["昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","香格里拉","安宁","德宏","怒江","迪庆","楚雄","红河","文山","西双版纳","大理","宣威","水富","腾冲","个旧","开远","蒙自","弥勒","景洪","瑞丽","芒市","泸水"],
    "河南":["郑州","开封","洛阳","平顶山","安阳","鹤壁","新乡","焦作","濮阳","许昌","漯河","三门峡","商丘","周口","驻马店","南阳","信阳","济源",
            "巩义","新郑","登封","荥阳","新密","汝州","林州","卫辉","辉县","沁阳","孟州","灵宝","义马","永城","邓州","禹州","长葛","项城","永城",
            "偃师","舞钢"],
    "山东":["济南","青岛","淄博","枣庄","东营","烟台","潍坊","济宁","泰安","威海","日照","滨州","德州","聊城","临沂","菏泽","莱芜",
           "胶州","平度","莱西","滕州","龙口","莱阳","莱州","蓬莱","招远","栖霞","海阳","诸城","青州",
           "寿光","安丘","昌邑","高密","邹城","曲阜","新泰","肥城","荣成","乳山","邹平","乐陵","禹城","临清"],
    "河北":["石家庄","唐山","秦皇岛","邯郸","邢台","保定","张家口","承德","沧州","廊坊","衡水",
           "晋州","新乐","辛集","遵化","迁安","武安","南宫","沙河","安国","高碑店","涿州","定州","平泉",
        "泊头","黄骅","河间","任丘","霸州","三河","深州"],
    "陕西":["西安","铜川","宝鸡","咸阳","渭南","延安","汉中","榆林","安康","商洛","兴平","杨凌","乾县","潼关","洛川","神木","米脂","靖边"],
    "山西":["太原","大同","阳泉","长治","晋城","朔州","忻州","晋中","临汾","吕粱","运城",
           "古交","潞城","高平","介休","永济","河津","原平","侯马","霍州","孝义","汾阳"],
    "湖北":["武汉","黄石","十堰","宜昌","襄阳","鄂州","荆门","孝感","荆州","黄冈","咸宁","随州","恩施土家","仙桃","潜江","天门",
            "大冶","丹江口","宜都","当阳","枝江","老河口","枣阳","宜城","钟祥","应城","安陆","汉川","石首","洪湖","松滋","麻城","武穴","赤壁",
            "广水","恩施","利川","神农架"],
    "湖南":["长沙","株洲","湘潭","衡阳","邵阳","岳阳","常德","张家界","益阳","郴州","永州","怀化","娄底","吉首",
            "浏阳","醴陵","韶山","湘乡","耒阳","常宁","武冈","临湘","汨罗","津市","沅江","资兴","洪江","冷水江","涟源"],
    "江西":["南昌","景德镇","萍乡","九江","新余","鹰潭","赣州","吉安","宜春","抚州","上饶",
            "乐平","瑞昌","共青城","庐山","贵溪","瑞金","井冈山","丰城","樟树","高安","德兴"],
    "黑龙江":["哈尔滨","齐齐哈尔","鸡西","鹤岗","双鸭山","大庆","伊春","佳木斯","七台河","牡丹江","黑河","绥化","大兴安岭",
             "尚志","五常","讷河","虎林","密山","铁力","富锦","绥芬河","海林","宁安","穆棱","东宁","北安","五大连池","安达","肇东","海伦"],
    "吉林":["长春","吉林","四平","辽源","通化","白山","松原","白城","延吉",
           "榆树","德惠","蛟河","桦甸","舒兰","磐石","公主岭","双辽","梅河口","集安","临江","扶余","洮南","大安","图们","敦化","珲春","龙井","和龙"],
    "辽宁":["沈阳","大连","鞍山","抚顺","本溪","丹东","锦州","营口","阜新","辽阳","盘锦","铁岭","朝阳","葫芦岛",
           "新民","瓦房店","庄河","海城","东港","凤城","凌海","北镇","盖州","大石桥","灯塔","调兵山","开原","北票","凌源","兴城"],
    "内蒙古":["呼和浩特","包头","乌海","赤峰","通辽","鄂尔多斯","呼伦贝尔","巴彦淖尔","乌兰察布","兴安盟","锡林浩特","阿拉善",
              "霍林郭勒","满洲里","牙克石","扎兰屯","额尔古纳","根河","丰镇","阿尔山","二连浩特"],
    "新疆":["乌鲁木齐","克拉玛依","吐鲁番","哈密","昌吉","博乐","库尔勒","阿克苏","阿图什","喀什","和田","伊宁","塔城","阿勒泰",
           "石河子","阿拉尔","图木舒克","五家渠","北屯","铁门关","双河","可克达拉","昆玉"],
    "西藏":["拉萨","日喀则","昌都","林芝","山南","那曲地区","阿里地区"],
    "青海":["西宁","海东","海北","黄南","海南","果洛","玉树","海西","格尔木","德令哈"],
    "甘肃":["兰州","嘉峪关","金昌","白银","天水","武威","张掖","平凉","酒泉","庆阳","定西","陇南","临夏","甘南",
            "玉门","敦煌","合作"],
    "宁夏":["银川","石嘴山","吴忠","固原","中卫","青铜峡","灵武","同心","盐池","中宁","海原","隆德","泾源","西吉","贺兰","平罗"],
    "福建":["福州","厦门","莆田","三明","泉州","漳州","南平","龙岩","宁德",
           "福清","长乐","永安","石狮","晋江","南安","龙海","邵武","武夷山","建瓯","漳平","福安","福鼎"],
    "台湾":["台北","高雄","基隆","台中","台南","新竹","嘉义","苗栗","彰化","云林","屏东","宜兰","花莲","台东","澎湖","桃园","屏东"],
    "广东":["广州","韶关","深圳","珠海","汕头","佛山","江门","湛江","茂名","肇庆","惠州","梅州","汕尾","河源","阳江","清远","东莞","中山","潮州","揭阳","云浮",
           "乐昌","南雄","高州","化州","信宜","四会","兴宁","陆丰","廉江","雷州","吴川","台山","开平","鹤山"
           ,"恩平","阳春","英德","连州","普宁","罗定"],
    "广西":["南宁","柳州","桂林","梧州","北海","防城港","钦州","贵港","玉林","百色","贺州","河池","来宾","崇左",
           "岑溪","东兴","桂平","北流","靖西","合山","凭祥"],
    "贵州":["贵阳","六盘水","遵义","安顺","毕节","铜仁","黔西","黔东","黔南","兴义","兴仁","凯里","都匀","清镇","赤水","仁怀","福泉"],
}
var provinceA  =["热门","江苏","浙江","安徽","海南","四川","云南","河南",
    "山东","河北","陕西","山西","湖北","湖南","江西","黑龙江","吉林","辽宁",
    "内蒙古","新疆","西藏","青海","甘肃","宁夏","福建","台湾","广东","广西","贵州"
 ]
// 29个key

// for(var key in province){
//     console.log(province); 
// }

var htmlP = "" ,tet="",txt = "";
var pLength = provinceA.length;
// 默认的省市
for(var i=0;i<pLength;i++){
    if(i==0){
        tet=`
        <div data-p="${provinceA[0]}" data-id="${0}" class="active">
            <p>热门</p>
            <span class="select" style="display: none">1</span>
        </div>
        `
        var txxxt ="";
        for(var j in province[provinceA[0]]){
           
            txxxt +=`
            <p data-c="${province[provinceA[0]][j]}" data-select="${provinceA[0]}" data-pid=${0}>${province[provinceA[0]][j]}</p> 
            `;
        }
        txt = `<div class="city${i}">${txxxt}</div>`
    }else{
        htmlP +=`
        <div data-p="${provinceA[i]}" data-id="${i}">
            <p>${provinceA[i]}</p>
            <span class="select" style="display: none">1</span>
        </div>
        `
        var txxxt ="";
        $.each(province[provinceA[i]],function(index,value){
            txxxt +=`
            <p data-c="${value}" data-select="${provinceA[i]}" data-pid=${i}>${value}</p> 
            `;
        })
        txt += `<div class="city${i}" style="display:none">${txxxt}</div>`
    }
}
$('.province').html(tet+htmlP);
$('.city').html(txt)

var p=new Array(),c=[
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,0
];

//所选择的城市
var selectCity=new Array();
for(var k=0;k<30;k++){ //一维长度为i,i为变量，可以根据实际情况改变
    selectCity[k]=new Array(); //声明二维，每一个一维数组里面的一个元素都是一个数组；
    for(var j=0;j<p;j++){ //一维数组里面每个元素数组可以包含的数量p，p也是一个变量；
        selectCity[k][j]=""; //这里将变量初始化，我这边统一初始化为空，后面在用所需的值覆盖里面的值
    }
}
console.log(c.length);

$('.city').on('click','p',function(){
    var $this =$(this);
    var pid = $this.attr('data-pid');
    var city = $this.attr('data-c');
    var pro = $this.attr('data-select');

    // console.log(pid);
    if($this.hasClass('active')){
        c[pid]--;
        selectCity[pid][ selectCity[pid].indexOf( city ) ] = null;
        selectCity[pid].splice( selectCity[pid].indexOf( null ), 1 );

        // 选择的省
        if(parseInt(pid) ==0){
           
            p[ p.indexOf( city ) ] = null;
            p.splice( p.indexOf( null ), 1 );      
        } else{
            if(c[pid]<1){
                // (parseInt(pid)==0) ? p[ p.indexOf( city ) ] = null : p[ p.indexOf( pro ) ] = null;
                console.log(11111);
                if(parseInt(pid) ==0){
                    p[ p.indexOf( city ) ] = null;
                    p.splice( p.indexOf( null ), 1 ); 
                }else{
                    p[ p.indexOf( pro ) ] = null
                    p.splice( p.indexOf( null ), 1 );
                }
            } 
        }
        $(this).removeClass('active');
    }else{
        c[pid]++;
        selectCity[pid].push(city);

        // 选择的省以及直辖市

        // 如果选择的是 热门  往p里面添加city 否则添加省（pro）
        if(parseInt(pid) == 0){
            // 如果省里面已经有选择过得了，就不添加
            if(p.indexOf(city)==-1){
                 p.push(city);
            }
        }else{
            if(p.indexOf(pro)==-1){
                p.push(pro);
            }
        }
        $(this).addClass('active');
    }
    // console.log(selectCity);// 选择的市
    // console.log(p);// 选择的省
    if(c[pid]>0){
        $('div[data-id='+pid+']').find('.select').show();
        $('div[data-id='+pid+']').find('.select').text(c[pid]);
    }else{
        $('div[data-id='+pid+']').find('.select').hide();
        $('div[data-id='+pid+']').find('.select').text(c[pid]);
    } 
})

// 点击省出现市级
$('.province').on('click','div',function(){
    var $this =$(this);
    var pid = $this.attr('data-p');
    var id = $this.attr('data-id');
    $(this).addClass('active').siblings().removeClass('active');

    $('.city'+id).show().siblings().hide();
})

// 提交
$('.submit').click(function(){
    var singleCity=new Array();

    $('.loading').show();
    $.each(selectCity,function(index,value){
        if(value.length>0){
            for(var i=0;i<value.length;i++){
               
                singleCity.push(value[i]);
            }
        }
    }) 
  
    setTimeout(function(){
        $('.loading').hide();
        // 我自己选择的城市以及省份
        var city = singleCity.length;
        var pro = p.length;
        console.log(singleCity.length); //城市
        console.log(p.length); //省份
        $.get("http://g5.guangjixinxi.com/spfdt/Index/addNum",{
            pro:pro,
            city:city
        },function(res){
            console.log(res);
            location.href = "http://g5.guangjixinxi.com/spfdt/Index/map";
        });
    },1500)
    
    sessionStorage.setItem('city',JSON.stringify(singleCity));
    sessionStorage.setItem('provence',JSON.stringify(p));   
})